<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>BarcodesSearcherModel.mlmodelc/coremldata.bin</key>
		<data>
		5aEh+34wdhZm7Z3M7gXQGNzfI/M=
		</data>
		<key>BarcodesSearcherModel.mlmodelc/model.espresso.net</key>
		<data>
		C/WZOos51rZuewPuHuxkfyZu80M=
		</data>
		<key>BarcodesSearcherModel.mlmodelc/model.espresso.shape</key>
		<data>
		r6xtN+n50I4iI1DcIs2T0/r3A14=
		</data>
		<key>BarcodesSearcherModel.mlmodelc/model.espresso.weights</key>
		<data>
		QatG84RGOVYi8zXwbIQM/ZgUGx8=
		</data>
		<key>BarcodesSearcherModel.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>BarcodesSearcherModel.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>Camera Dummy.jpg</key>
		<data>
		BgiRYerGnv0zfmfGhpSV4zrOZM8=
		</data>
		<key>DefaultUI.storyboardc/889-mQ-RVI-view-tRO-aV-ABl.nib/objects-12.3+.nib</key>
		<data>
		FCgpQRdo6858uRUUrLykyQDnRq4=
		</data>
		<key>DefaultUI.storyboardc/889-mQ-RVI-view-tRO-aV-ABl.nib/runtime.nib</key>
		<data>
		4z6WgQ50HWI+sczHk4Xwrxtf5AY=
		</data>
		<key>DefaultUI.storyboardc/957-X1-Qmc-view-iiQ-nJ-Zdy.nib/objects-12.3+.nib</key>
		<data>
		qawNgs4geZt2spd3ZZ6cAzQWVoM=
		</data>
		<key>DefaultUI.storyboardc/957-X1-Qmc-view-iiQ-nJ-Zdy.nib/runtime.nib</key>
		<data>
		rcF26rNGG21/+vvhW7pSJqGcUGI=
		</data>
		<key>DefaultUI.storyboardc/9lv-sb-jsd-view-mUi-nu-eoE.nib/objects-12.3+.nib</key>
		<data>
		zUcpZlbT9AUsYbdfiFqTevcMecA=
		</data>
		<key>DefaultUI.storyboardc/9lv-sb-jsd-view-mUi-nu-eoE.nib/runtime.nib</key>
		<data>
		S1Uj/0qpeE0wBUaKDZHnfldMIbg=
		</data>
		<key>DefaultUI.storyboardc/DCg-dj-dwO-view-yeX-lg-tDW.nib/objects-12.3+.nib</key>
		<data>
		J4n1I6ee21GnunihY0HK/iuKPOg=
		</data>
		<key>DefaultUI.storyboardc/DCg-dj-dwO-view-yeX-lg-tDW.nib/runtime.nib</key>
		<data>
		umF1gOBLn9M8jvC5vAoGApr53Ck=
		</data>
		<key>DefaultUI.storyboardc/DYV-NY-REA-view-7u9-Ot-iKq.nib/objects-12.3+.nib</key>
		<data>
		I/cTBWNyB6ojzHcWOTJqNd6Ejlk=
		</data>
		<key>DefaultUI.storyboardc/DYV-NY-REA-view-7u9-Ot-iKq.nib/runtime.nib</key>
		<data>
		rbgq9tnZ5OBQZyTZD+80G3QXm1E=
		</data>
		<key>DefaultUI.storyboardc/Dfl-Ye-hMZ-view-WSJ-D2-0FR.nib/objects-12.3+.nib</key>
		<data>
		6BgXiOV5bP6NfSc7REkNMRkVRs8=
		</data>
		<key>DefaultUI.storyboardc/Dfl-Ye-hMZ-view-WSJ-D2-0FR.nib/runtime.nib</key>
		<data>
		y8RVYD8mTJHiDbArirt83Yal2nE=
		</data>
		<key>DefaultUI.storyboardc/DhX-aj-xZa-view-pWi-Gn-2Tk.nib/objects-12.3+.nib</key>
		<data>
		qPawxAO9ZSRWInZWeGLp5nnub+o=
		</data>
		<key>DefaultUI.storyboardc/DhX-aj-xZa-view-pWi-Gn-2Tk.nib/runtime.nib</key>
		<data>
		qRjuB69qs+osvGNImm6/vxh/p3k=
		</data>
		<key>DefaultUI.storyboardc/Dxt-Lk-qaw-view-Ckk-PY-Cxr.nib/objects-12.3+.nib</key>
		<data>
		sm005k+GgeD/JQ8GD2Jv1ZojSoo=
		</data>
		<key>DefaultUI.storyboardc/Dxt-Lk-qaw-view-Ckk-PY-Cxr.nib/runtime.nib</key>
		<data>
		x7eIu8bbKbjx0Lh6xTyAqnsloZc=
		</data>
		<key>DefaultUI.storyboardc/FD1-Cw-yX4-view-PEF-AW-Bmj.nib/objects-12.3+.nib</key>
		<data>
		cnKbjE7T1/EeU9MALDBktU9/DEs=
		</data>
		<key>DefaultUI.storyboardc/FD1-Cw-yX4-view-PEF-AW-Bmj.nib/runtime.nib</key>
		<data>
		T0nRvl+7bpidrwUNcBuxJcoX01s=
		</data>
		<key>DefaultUI.storyboardc/Info.plist</key>
		<data>
		kfi4aE8NR9jdemay2jXa1peqjZ0=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeBatchDetailsViewController.nib/objects-12.3+.nib</key>
		<data>
		7n7g1jqkZkMj8ZTBOiSnYHbbH/8=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeBatchDetailsViewController.nib/runtime.nib</key>
		<data>
		GlvJt0USwe5E72Uvddvx7PhPUFE=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		e8z63BAJWkDj+WILLUenwKBpFgI=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeScannerViewController.nib/runtime.nib</key>
		<data>
		NyQDr4EmddXg5yyYCAwDPhLqYp4=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodesBatchScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		E2s4lf4bHbazGAxfcybCQFsSM94=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodesBatchScannerViewController.nib/runtime.nib</key>
		<data>
		rKrszvyX8F2PrKDZP35TcVJfn8Y=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUICroppingViewController.nib/objects-12.3+.nib</key>
		<data>
		Ifk0dUa4t4OHfhUMNXYxOuzkqMo=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUICroppingViewController.nib/runtime.nib</key>
		<data>
		CUZbMwbl16st/zyjUTzJtShEVd8=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIDocumentScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		64INcdbNr1M+fUHNHWUOSIWd8Ok=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIDocumentScannerViewController.nib/runtime.nib</key>
		<data>
		+FwRWlZXHU/on7wqRaTItby5BwI=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIEnableCameraViewController.nib/objects-12.3+.nib</key>
		<data>
		qsGVbglK4KDHq9shiYp6c44OLMI=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIEnableCameraViewController.nib/runtime.nib</key>
		<data>
		Bcp10gq6l2d7d40Ni629T6HqAZo=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIFilteringViewController.nib/objects-12.3+.nib</key>
		<data>
		PZnO8wsjiXf2I4Pcg066RPjszPc=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIFilteringViewController.nib/runtime.nib</key>
		<data>
		qEHjgBhGCNGEH+OU92rCNZKl320=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIHealthInsuranceCardScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		d2JKJd1bb6+hkkfPRbu6LxisJlw=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIHealthInsuranceCardScannerViewController.nib/runtime.nib</key>
		<data>
		+y7OiiUJJoMyUrxFVf6jXmoVsWU=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIIDCardScannerDetailsViewController.nib/objects-12.3+.nib</key>
		<data>
		isjCexG7THPrnwDouKjqenneeiM=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIIDCardScannerDetailsViewController.nib/runtime.nib</key>
		<data>
		K+EhsCLj7C6CdNjNm6YgjmtrDss=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerConfidenceViewController.nib/objects-12.3+.nib</key>
		<data>
		whLWFqyxwt3SI+krbGNmj7xZ9OM=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerConfidenceViewController.nib/runtime.nib</key>
		<data>
		QkrC6GTZZHqa3CIigXi8fwEF9QQ=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		yt3cEgP301YrTJi4HyYkB/vpdVI=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerViewController.nib/runtime.nib</key>
		<data>
		Orhwmx/2ebvMSG7tOVZJWHC/P2g=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIMRZScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		ilfFYmFmsQH3ZM5+iZ3TzVnKO3A=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIMRZScannerViewController.nib/runtime.nib</key>
		<data>
		HDFKiUzD9YGpO0TVW97DOGsL1Hg=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIMultipleObjectScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		hiGKZyzsdm50bGBjR90yfbHfBts=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIMultipleObjectScannerViewController.nib/runtime.nib</key>
		<data>
		Qsw2Unqpwy9qFoWhfrPx0adHTRs=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUINFCPassportReaderViewController.nib/objects-12.3+.nib</key>
		<data>
		FEeZDtJLEzeB22C7lrUCbteYsSs=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUINFCPassportReaderViewController.nib/runtime.nib</key>
		<data>
		tAQtIFsa4Egxz3SMnnqLiZzNVoM=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIPageReviewViewController.nib/objects-12.3+.nib</key>
		<data>
		nMVFiYSp8bdbRpDrTpVPZQ7sbJc=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIPageReviewViewController.nib/runtime.nib</key>
		<data>
		mPI1rSn8UemNGWVTpludFvLWQNM=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIScannerBottomButtonsViewController.nib/objects-12.3+.nib</key>
		<data>
		9+aRwVWQoMMMJWKcy8AIk3p4M1w=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIScannerBottomButtonsViewController.nib/runtime.nib</key>
		<data>
		7/e+J5+I4wtKB6WGvkLCTAv+f5A=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIWorkflowScannerViewController.nib/objects-12.3+.nib</key>
		<data>
		0srbu3quSUGKIwE3p9XfGogiB5g=
		</data>
		<key>DefaultUI.storyboardc/SBSDKUIWorkflowScannerViewController.nib/runtime.nib</key>
		<data>
		f4dq6rZN4hYUOGNoGz10XlL/iwY=
		</data>
		<key>DefaultUI.storyboardc/VU0-70-tjw-view-YKw-wR-jB1.nib/objects-12.3+.nib</key>
		<data>
		nB3cC2HNhGI+PjvKlJRSzEQsF+s=
		</data>
		<key>DefaultUI.storyboardc/VU0-70-tjw-view-YKw-wR-jB1.nib/runtime.nib</key>
		<data>
		Ab7YHzFzzfeUmLVpbQ/u3EMZ3KQ=
		</data>
		<key>DefaultUI.storyboardc/XQQ-pk-yhd-view-8N3-Dx-sit.nib/objects-12.3+.nib</key>
		<data>
		4J5elo8zGHfJ4EQspqvouZdv+Z8=
		</data>
		<key>DefaultUI.storyboardc/XQQ-pk-yhd-view-8N3-Dx-sit.nib/runtime.nib</key>
		<data>
		VD+kivA4j7WgZEwYLMXddHoBxsE=
		</data>
		<key>DefaultUI.storyboardc/Yhi-HJ-kja-view-38O-SV-UhB.nib/objects-12.3+.nib</key>
		<data>
		YDtjkX3tBknGNEteho68rwQ3d/E=
		</data>
		<key>DefaultUI.storyboardc/Yhi-HJ-kja-view-38O-SV-UhB.nib/runtime.nib</key>
		<data>
		yQoR6hZXFPXGTWLw0VHR/vC/pI4=
		</data>
		<key>DefaultUI.storyboardc/Yjh-5a-9DP-view-nON-sO-6XV.nib/objects-12.3+.nib</key>
		<data>
		eDzCw0LrVxEcTTYsV+JdzXayDNk=
		</data>
		<key>DefaultUI.storyboardc/Yjh-5a-9DP-view-nON-sO-6XV.nib/runtime.nib</key>
		<data>
		24zehHyoVSphLQHRZc3KtNHVaEI=
		</data>
		<key>DefaultUI.storyboardc/eQX-bE-Ux6-view-2Ew-EC-8GS.nib/objects-12.3+.nib</key>
		<data>
		8aGQ3kF3OzH+gRI3cBABxvrWmWM=
		</data>
		<key>DefaultUI.storyboardc/eQX-bE-Ux6-view-2Ew-EC-8GS.nib/runtime.nib</key>
		<data>
		P99SXcNzLONOCvLhQmeSogMKTuI=
		</data>
		<key>DefaultUI.storyboardc/evF-iu-CIi-view-Bi4-0u-Txz.nib/objects-12.3+.nib</key>
		<data>
		drsC0oJ6OZ/pHX8QdK2rCkI5cUg=
		</data>
		<key>DefaultUI.storyboardc/evF-iu-CIi-view-Bi4-0u-Txz.nib/runtime.nib</key>
		<data>
		TX6prMvEsQlQ9Aelhtpm1INlAMs=
		</data>
		<key>DefaultUI.storyboardc/knH-wI-eUH-view-xtk-8f-w2e.nib/objects-12.3+.nib</key>
		<data>
		F0vT7glQkSAuz47N9AVskeRtm+I=
		</data>
		<key>DefaultUI.storyboardc/knH-wI-eUH-view-xtk-8f-w2e.nib/runtime.nib</key>
		<data>
		HmJqwseWegBIY2whx8HFIvXFYOo=
		</data>
		<key>DefaultUI.storyboardc/mKi-5s-kli-view-kGR-a0-dCN.nib/objects-12.3+.nib</key>
		<data>
		SneGXN02d+dKZ+atSQAhqLLTFAg=
		</data>
		<key>DefaultUI.storyboardc/mKi-5s-kli-view-kGR-a0-dCN.nib/runtime.nib</key>
		<data>
		moUT791jECWr7fOffOziBz/fa6g=
		</data>
		<key>IDCardScannerHandle.png</key>
		<data>
		eAq+jxZxns8RIFHShH09U1yqN7A=
		</data>
		<key>IDCardScannerHandle@2x.png</key>
		<data>
		lbOI8UtQBrwv23vYzXIKlu3T4r0=
		</data>
		<key>IDCardScannerHandle@3x.png</key>
		<data>
		zCTmE0bXX0VLpd481Tk/OzqKzuU=
		</data>
		<key>ImageEditing.storyboardc/Info.plist</key>
		<data>
		WkshgGqK3PBMBp2AAG1UYJZe1kU=
		</data>
		<key>ImageEditing.storyboardc/Vwq-hB-na2-view-RhM-Dv-nUe.nib</key>
		<data>
		yfvs/6jlaMVcBeW8dsC+dY8giYU=
		</data>
		<key>ImageEditing.storyboardc/imageEditing.nib</key>
		<data>
		tUccIK/Ow1qH/eoI/7zYx+L/jf0=
		</data>
		<key>Info.plist</key>
		<data>
		7DZSpwjCwkyR+yeuiB+6NkNlns8=
		</data>
		<key>Licenses.txt</key>
		<data>
		13tdSn0E4ySus7WNWG/WHckRGi8=
		</data>
		<key>ScanbotSDK.bundle/BackgroundCleanFilterModel.tflite</key>
		<data>
		Fye6/UMJtc3FaS3YiS6nP8Bhnrg=
		</data>
		<key>ScanbotSDK.bundle/Bleep.m4a</key>
		<data>
		FJVFTlSRWLSWTSk0jYmzxM0v7es=
		</data>
		<key>ScanbotSDK.bundle/BlurEstimatorModel.tflite</key>
		<data>
		X4aUciLjYNhgXN1PeCCKPIfJM9s=
		</data>
		<key>ScanbotSDK.bundle/CountryCodeToLanguageCode.plist</key>
		<data>
		/8hsjE0iL/pHMQx7U0nEq9iY25o=
		</data>
		<key>ScanbotSDK.bundle/Info.plist</key>
		<data>
		qFxWcEyTCT/BRvFqs6xa0F8XMbs=
		</data>
		<key>ScanbotSDK.bundle/LanguageToTesseractTrainedData.plist</key>
		<data>
		b4gVs7aajWO2DI6SGUxn+Wn8zbA=
		</data>
		<key>ScanbotSDK.bundle/Licenses.txt</key>
		<data>
		13tdSn0E4ySus7WNWG/WHckRGi8=
		</data>
		<key>ScanbotSDK.bundle/MLBinarization.tflite</key>
		<data>
		gZj4CLlRC5e0dDMMHIQESnMyWMo=
		</data>
		<key>ScanbotSDK.bundle/SBSDKChequeData/ChequeDigitRecognizerModel.tflite</key>
		<data>
		Z9FUHNnA9qNCRLBnK91rtH/Ey2g=
		</data>
		<key>ScanbotSDK.bundle/SBSDKDCData/DCDigitRecognizerModel.tflite</key>
		<data>
		88Xvl4RPOoQUYlJHg+ZVYlCbQO0=
		</data>
		<key>ScanbotSDK.bundle/SBSDKDCData/DCLabelImagePreprocessor.tflite</key>
		<data>
		FLXlZ46b5PsM3idc3zq79RVmguM=
		</data>
		<key>ScanbotSDK.bundle/SBSDKIDCardData/char-ocrb-20200520-3.tflite</key>
		<data>
		UZdX8PdjWqOYWdmEINWs1fCUH0s=
		</data>
		<key>ScanbotSDK.bundle/SBSDKIDCardData/id-card-binarization-20200519-2.tflite</key>
		<data>
		mPGCKN+KZA/5YpXTjcBgnhU6hxM=
		</data>
		<key>ScanbotSDK.bundle/SBSDKIDCardData/id-card-localization-20200703-2.tflite</key>
		<data>
		uvGale2omYimcEI8LKsy3dTSI0U=
		</data>
		<key>ScanbotSDK.bundle/SBSDKPDFData/pdf.dat</key>
		<data>
		gIWxghEclQfaKOqDE5g4fUYcEH4=
		</data>
		<key>ScanbotSDK.bundle/SBSDKPDFData/pdf.ttx</key>
		<data>
		qX79xHAtx2WFw3XVvNvIGfRI0QU=
		</data>
		<key>ScanbotSDK.bundle/SBSDKPayformData/banks.csv</key>
		<data>
		rEji5xf8YOn1OgsckiGtzODBGYg=
		</data>
		<key>ScanbotSDK.bundle/barcode-binarization-model-20200624-1.tflite</key>
		<data>
		17m5hkTzNXfNn5uc80Q3ETqW4Pg=
		</data>
		<key>ScanbotSDK.bundle/barcode-detector-20200625-1.tflite</key>
		<data>
		BptvIbd553N8sjo2fGONfJn4yAE=
		</data>
		<key>ScanbotSDK.bundle/id-card-binarization-20200519-2.tflite</key>
		<data>
		mPGCKN+KZA/5YpXTjcBgnhU6hxM=
		</data>
		<key>default.metallib</key>
		<data>
		GLtM/WWubv2Bzqdd/6FwGGiRQKI=
		</data>
		<key>ico_capture_reviewarrow.png</key>
		<data>
		3FGOItwmwlNJDxGvYDFZEvCDEzs=
		</data>
		<key>ico_capture_reviewarrow@2x.png</key>
		<data>
		RVlxckqx58DbCd6E+MoQKhy6rAI=
		</data>
		<key>ico_capture_reviewarrow@3x.png</key>
		<data>
		yoIVpsCnpSlEj1GJ0vlKtSIfk+E=
		</data>
		<key>icon_check.png</key>
		<data>
		0RuY9UyeyWb365euLsRORaLb2VQ=
		</data>
		<key>icon_check@2x.png</key>
		<data>
		/Pm5JEWE6wICqqZY6bNxAi8kPZE=
		</data>
		<key>icon_check@3x.png</key>
		<data>
		MzSFm39O1jsONe/Ykc2bicnCPgg=
		</data>
		<key>icon_x.png</key>
		<data>
		Y4Pto64xyuL0t7FtXvDVzJNdOPU=
		</data>
		<key>icon_x@2x.png</key>
		<data>
		qtKEyPOY3SxsGZIN6OKSEug/j00=
		</data>
		<key>icon_x@3x.png</key>
		<data>
		xKl4vUvA7bWfBq5ntjmlpRL9pKE=
		</data>
		<key>no-nfc.png</key>
		<data>
		s8B3Cw9/O6Uu0CCPBGeUfDqTDuw=
		</data>
		<key>no-nfc@2x.png</key>
		<data>
		VuFaAQLdxv+/U9FZbR+1nTxgjUI=
		</data>
		<key>no-nfc@3x.png</key>
		<data>
		c4U6ZKiCBOtp1TBcr6pBTB1OoVQ=
		</data>
		<key>strip-SBSDK-Framework.sh</key>
		<data>
		CP1GqzCnjGhvmRV/7M7nJNl0kZ8=
		</data>
		<key>ui_capture_edit_magnifier.png</key>
		<data>
		JFXla/tbwttc7HmBKIcesv2eOi0=
		</data>
		<key>ui_capture_edit_magnifier@2x.png</key>
		<data>
		svgwqJAf1vqIshWAho4aS57VbI8=
		</data>
		<key>ui_capture_edit_magnifier@3x.png</key>
		<data>
		oioRAu5jdwjrszWSosi0G+lsSYk=
		</data>
		<key>ui_scan_handlebig.png</key>
		<data>
		406EzPW0a3PcV6qTSQRAy+cU/cc=
		</data>
		<key>ui_scan_handlebig@2x.png</key>
		<data>
		ifw37hVMt5Adj+k+aW1EwnQDZKU=
		</data>
		<key>ui_scan_handlebig@3x.png</key>
		<data>
		dvZe/2Cu918yDgVMUXGXx8xT9vs=
		</data>
		<key>ui_scan_handlesmall.png</key>
		<data>
		jziiNQnqpM4LepFJSSJD0yMMQDg=
		</data>
		<key>ui_scan_handlesmall@2x.png</key>
		<data>
		Bb0t/uVOaZJLqm3GjVIoHumc5UM=
		</data>
		<key>ui_scan_handlesmall@3x.png</key>
		<data>
		egfuXPbQUYX7U5TJ3rsWrLnzhZg=
		</data>
		<key>ui_scan_snapbutton_active.png</key>
		<data>
		ihfLOd6DxpPXpTE4Q/y7cdUD2jw=
		</data>
		<key>ui_scan_snapbutton_active@2x.png</key>
		<data>
		Ixfxy6WLm7BrEJ6bIZl5YW8Fqk0=
		</data>
		<key>ui_scan_snapbutton_active@3x.png</key>
		<data>
		M2+v9Em1ZBnH3v7Mhxr5f7pWSZo=
		</data>
		<key>ui_scan_snapbutton_innerarc.png</key>
		<data>
		xQ+MLvipdtXngnU2JkXKASzdufw=
		</data>
		<key>ui_scan_snapbutton_innerarc@2x.png</key>
		<data>
		vA9lHteAo436/uJgfMZcYVK3mbA=
		</data>
		<key>ui_scan_snapbutton_innerarc@3x.png</key>
		<data>
		iskwS/LTtECoZhxY57nKFEHvCOU=
		</data>
		<key>ui_scan_snapbutton_outerarc.png</key>
		<data>
		vKdKNjd323Tx6Tahr1NkGPxMAiE=
		</data>
		<key>ui_scan_snapbutton_outerarc@2x.png</key>
		<data>
		FdC3LfiYjFCdZRKOW4FD0NJT9fM=
		</data>
		<key>ui_scan_snapbutton_outerarc@3x.png</key>
		<data>
		btomXFKE377RZV7r8n1XenNbk/8=
		</data>
		<key>ui_scan_snapbutton_outerring.png</key>
		<data>
		8DsVYzT73agqU2lYcPBiVcOWKLc=
		</data>
		<key>ui_scan_snapbutton_outerring@2x.png</key>
		<data>
		l7+/Lyn6lyOgQwZFQNmJyUJ41ts=
		</data>
		<key>ui_scan_snapbutton_outerring@3x.png</key>
		<data>
		b8app60TdI7O1IGosbqmTHb5GOo=
		</data>
		<key>ui_scanning_automatic.png</key>
		<data>
		yw/bNQvoz5Nb5pBpybscMkdtCpk=
		</data>
		<key>ui_scanning_automatic@2x.png</key>
		<data>
		M8IIS6+suwHqEgTMtdAapb5Gx8U=
		</data>
		<key>ui_scanning_automatic@3x.png</key>
		<data>
		InUmjomK/nVVnyYaNGlx43xIv0A=
		</data>
		<key>ui_scanning_delete.png</key>
		<data>
		/WrCvxjSH3PTgz2wUGAohKL9nqg=
		</data>
		<key>ui_scanning_delete@2x.png</key>
		<data>
		orR4sTgoQEd8hlXMOsjbGxCUXaI=
		</data>
		<key>ui_scanning_delete@3x.png</key>
		<data>
		YVg4QYtf+KUBpcYYYzwhuwRSuX4=
		</data>
		<key>ui_scanning_flash.png</key>
		<data>
		pp7BTtvCnsMoTiJZPx7Z3JoxWkY=
		</data>
		<key>ui_scanning_flash@2x.png</key>
		<data>
		f8ddc4vkAOEJHYseEEDLCev8uuY=
		</data>
		<key>ui_scanning_flash@3x.png</key>
		<data>
		nka3lbvuZIEaWAsKl10vwyNGaIE=
		</data>
		<key>ui_scanning_flash_off.png</key>
		<data>
		FYYF2RWD8R2ujVTLeNL3T0qw2UQ=
		</data>
		<key>ui_scanning_flash_off@2x.png</key>
		<data>
		UMTustKfqglcMpldwIwoYKuFSqY=
		</data>
		<key>ui_scanning_flash_off@3x.png</key>
		<data>
		n93SUHjw8fZwXAjbkSHzlJ5V0jk=
		</data>
		<key>ui_scanning_flash_on.png</key>
		<data>
		eTGAXDXxZPXfqq9Rrd0AwZwOHaw=
		</data>
		<key>ui_scanning_flash_on@2x.png</key>
		<data>
		GcxAIco4h3/qyEzJbWhzfrBR4VY=
		</data>
		<key>ui_scanning_flash_on@3x.png</key>
		<data>
		N5s9bRIeJsbS7atwxfZ5bQbBs/U=
		</data>
		<key>ui_scanning_multipage.png</key>
		<data>
		+3tttdYCi7BAXpZPKdv/qqUgaUA=
		</data>
		<key>ui_scanning_multipage@2x.png</key>
		<data>
		QySclLdR+EzPfosgdgg4ZSiQu1c=
		</data>
		<key>ui_scanning_multipage@3x.png</key>
		<data>
		nXoa4kWf5uIglZ1APoQd3YUzeZY=
		</data>
		<key>ui_scanning_permission.png</key>
		<data>
		hVcurEQZMGc4dcJMmDx8zWvj2UY=
		</data>
		<key>ui_scanning_permission@2x.png</key>
		<data>
		ZE2r6u0SXzWi77nGaMdNjGFYNjo=
		</data>
		<key>ui_scanning_permission@3x.png</key>
		<data>
		aU//I6xhLpQgDVw/xFtX0CoXpAA=
		</data>
		<key>ui_sdk_split_view.png</key>
		<data>
		d4q4H7w6QCgXkQE6q9SakgmrYvg=
		</data>
		<key>ui_sdk_split_view@2x.png</key>
		<data>
		+YSlEB5+3sthYpD5DUBgkU0jWI4=
		</data>
		<key>ui_sdk_split_view@3x.png</key>
		<data>
		eR2PKAKpWaM32kqh9kecgFTw568=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>BarcodesSearcherModel.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5ObQD+ymQPUzDI+0JyUCUJwAi7+MJ3m1l/6/2Kp2+8I=
			</data>
		</dict>
		<key>BarcodesSearcherModel.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Ig6NHQ5cYS3JWIvf93tK+z9J2hLKVJnTcu4PFvFIaE0=
			</data>
		</dict>
		<key>BarcodesSearcherModel.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			6fv/EZvviaP+CEgg+JEYb+XJ4Tdo/db6HDX6q3jQcxE=
			</data>
		</dict>
		<key>BarcodesSearcherModel.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			KPzfZgHqKhH564BwM8LNNAXZdHzwB2v4X3XLUxO8cVg=
			</data>
		</dict>
		<key>BarcodesSearcherModel.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>BarcodesSearcherModel.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>Camera Dummy.jpg</key>
		<dict>
			<key>hash2</key>
			<data>
			14ydeMm0sGPIkf4lajpjkiaIac+xmBXx+6JKmZMFyXc=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/889-mQ-RVI-view-tRO-aV-ABl.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			ShkB77agYrxFsuaZsivE7Rp5KkCxcT9xm4hMP1g5u/8=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/889-mQ-RVI-view-tRO-aV-ABl.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			Z8yZwaU9PcZadKzc/Dw2rJMzutyCpdlf9L9LdAJV89k=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/957-X1-Qmc-view-iiQ-nJ-Zdy.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			tJ9BfDox3jMPpp6cey5UhPgvrE2t26+7U8ukTARevTU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/957-X1-Qmc-view-iiQ-nJ-Zdy.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			A5I7H1Xdkl54WYDOnE/w0uv2VYcbLU3z44DK6zS5lAU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/9lv-sb-jsd-view-mUi-nu-eoE.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			kFXGGLxpaGtPuHhUhC+5+uQed6UVZHviR3knn0tWnK4=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/9lv-sb-jsd-view-mUi-nu-eoE.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			flx5lwJdLV3Xu5zqxTRRkgaYvERbUvnIP+cH02F7ZjU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/DCg-dj-dwO-view-yeX-lg-tDW.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			V6OlsgE4oZZL2iw1RYTGnILmWxpfNsFb7z5uy6dR50w=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/DCg-dj-dwO-view-yeX-lg-tDW.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			bebWhr+py0TByX0Kr58PXCg0bxnoeRxOByOVZuybH/E=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/DYV-NY-REA-view-7u9-Ot-iKq.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			ezM/M0+7C+/u54VsRxnqTRXmoqXkuutzMqlHBHNaIIs=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/DYV-NY-REA-view-7u9-Ot-iKq.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			e5nisxaBPvw93yB8C3hXCZkESenGqWk86vSvLZqKFXQ=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Dfl-Ye-hMZ-view-WSJ-D2-0FR.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			vQOernaj8cwROJr/5OOhta1c1toFZNX84YjYux15gJg=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Dfl-Ye-hMZ-view-WSJ-D2-0FR.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			My3wxRrD6u+gNBHf1lLAmnbT53bSj5VaX3uqPvGyu2k=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/DhX-aj-xZa-view-pWi-Gn-2Tk.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			KM7tvfo0HLL8ER5YIFU8y4peK2Ksu9kAlcH21RGts60=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/DhX-aj-xZa-view-pWi-Gn-2Tk.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			qS1LvaolZ8XKCZ4vvbgO+kmj5LMCJO2FAQ9sO4LGA2M=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Dxt-Lk-qaw-view-Ckk-PY-Cxr.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			MGymHlSY3yAqaRedMEyG0okUqwUHRWHWrRtK6Y/fpFM=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Dxt-Lk-qaw-view-Ckk-PY-Cxr.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			AW+bpdydWQeJ+Gjtw1zb+8HLoB8QN+uttYVaLv1czNY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/FD1-Cw-yX4-view-PEF-AW-Bmj.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			pJ4nI4n6D8bDXCwhghZF1h7agrVdOd6sN+tsvRtL+Qg=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/FD1-Cw-yX4-view-PEF-AW-Bmj.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			1dFKFBlteAolVwJbm7FPeb3ghYy/w+zRm0Qr/CVdQCY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			0tk8YesNRm6JRoGkII0QdqYnA1Kqh3al1X82I0LVLB8=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeBatchDetailsViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			lbn9CqreWpZQSVrINhb8qLWli9xQsh2ichZtpwWwHlU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeBatchDetailsViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			plMBElAuC3vtJlUu64UzHMZtFK6xqoJvgi0aLVeEy+k=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			F8cUoM+u4WHnPAfKuTgP8Xi9KfdoHplMQFt9RdZ2SJU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodeScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			98agcVIXhWQ6xQLt8R8cWR6xqVhg+aduhYA/jQVZQh8=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodesBatchScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			LJ0Dj+51Sql5Rb9HOl34h+GqEPxe85URHXgoPFtAwYc=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIBarcodesBatchScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			WdWBftpglZ+GeB89dq6G/hs3eX+TmMF98MaUSpiRKqs=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUICroppingViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			OJ1M0Z9xldaMstG6zOZnel9PQLepBdttqw6RerN54Yk=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUICroppingViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			aD2OHx2an9nGeZwzr8KRbeTGtgC+W0gc+PzbE/1yh8E=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIDocumentScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			p0GoBC3ng7bqpur9dKprR/l8jO9Cq5SEWv6/CbOg/lU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIDocumentScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			Zs6l9pY09yGOPd4RQCPKc3yr2YZg7+UeXCK8gQYHawQ=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIEnableCameraViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			jL6lXpecSiOlRw49JYxNb80VlxzVtfjqBQ2FJZgezn4=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIEnableCameraViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			52W5q67lNXoM3DpHeqL5E1m3E/B2Mz+az5DAlqUoNmg=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIFilteringViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			wiQeZ13c1lCcd2fJN65wavwu9QC/vEpUL/qLbYyCySg=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIFilteringViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			vjg9jwZz3f2uV8jFkfZgMRxo2M3pZUD2nVWiMt/s2KI=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIHealthInsuranceCardScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			CwHouzKv9P9GvX4ovs9QVnxa3LCzyA4EFgaE5le98E4=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIHealthInsuranceCardScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			eAtxLNuAA3Xd9Q97udao9SuTnEMErkky7dk8AJQi+8w=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIIDCardScannerDetailsViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			mblDcG73Xyyx/BzrRriBQf0HZWILGr0/EoM0V+ynlTQ=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIIDCardScannerDetailsViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			b2Ara9eEfcDYcp2/8aFo27MH1qp+x9KcH99qbHfXpfE=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerConfidenceViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			ZlTCmdZsBjMNIxtOFeyHC8uklw8mVqW9un5uNOzie6I=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerConfidenceViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			Y6T2wSwMmQawbUo2T+9TlPhImhcWyAx6gVd6CQuiRbo=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			nCzIlH6/wF9pWJP8CWslDwu//KKtaJp+sFczTWdiaoU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIIDScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			0NQYdpPLLdQh6SjLN3cX3sMkFEn6Nt4bqEcgPBSNEX0=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIMRZScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			JgzjqqlkMc1v4LEcVRZwBMrubcb7YzQPq52FvvjO2mo=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIMRZScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			aWrFcJJGqSeAKuob3GCAr+vtatum6LX3DlD6Cua6aWM=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIMultipleObjectScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			YXCZPBC/wmHxCJ6iNvZPXINHKofK76av2z60bOAYM0w=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIMultipleObjectScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			5FIWQXHVxFcv4AS+Zn/QBEULY3Qv/p4tW2PZyKrN1CY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUINFCPassportReaderViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			G6d46xj28jNlaw9biSyaglHDWrR9ZWgnibsz2hO9LIo=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUINFCPassportReaderViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			mL6AWxkO3/cUg6MRRfWy2PdUdx7G7uJn465GSTudsbw=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIPageReviewViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			7LR1UNLvPBrGbgsY59PrVVVzFVU0ubmQPI7jsXpQEm4=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIPageReviewViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			WEAyV2A9VM6ZnvdL2/FhhlW6Zei/gH6uEADMVFRm64U=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIScannerBottomButtonsViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			yEWcXAOTb6knyePQOODHf+CeP8Rkmxhdz8qdl0AYcSU=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIScannerBottomButtonsViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			jiFIfMCP9+yIg1t03e9UiDjtqK6Y/n+mrw1V9r2jbL4=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIWorkflowScannerViewController.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			aUSBIYYESnl+HybCYFJg1maDfKs2G82BgOVPbfNuUbw=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/SBSDKUIWorkflowScannerViewController.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			VL4ILt+Zy6yYrpnOms47L/AGPZGr2pToD3Rj5RLgKEY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/VU0-70-tjw-view-YKw-wR-jB1.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			9YtvAjFdCkye43qCEMm2kfOYoPdZ0w5ofRylm8j8V3c=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/VU0-70-tjw-view-YKw-wR-jB1.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			CTHCmf8gUUdTd4IQDNxhAYT9Re8dJHKTEgXjQLvstgg=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/XQQ-pk-yhd-view-8N3-Dx-sit.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			U3nyqOdZZr5u+L1/dPRcyKVz6otAppQjKvs+5nLiDYw=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/XQQ-pk-yhd-view-8N3-Dx-sit.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			qtT6jOSeupjtUm2Rn8Sx24cw53/o3jkiDTaJakNAqo8=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Yhi-HJ-kja-view-38O-SV-UhB.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			f6S1BHXwShBkPAwWPSuk36zky85x4QpeqwNKvLkb6yQ=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Yhi-HJ-kja-view-38O-SV-UhB.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			IQUgyAl3zktWMJwvzjBSydUPbbZ8lNW3v7OfndhY9WA=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Yjh-5a-9DP-view-nON-sO-6XV.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			TvsCVWI94rW7fxgghpqKdBSMb4+9smXfjtEE8lFAeno=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/Yjh-5a-9DP-view-nON-sO-6XV.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			sybBHNN68hzbqj37RRaOcDv+5rG2SAAP31n+2ITaDqs=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/eQX-bE-Ux6-view-2Ew-EC-8GS.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			w5eJ8GbdmXGGBE7AsuvJZRx/7Hba2BUh2HQdqqrI7VY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/eQX-bE-Ux6-view-2Ew-EC-8GS.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			g6SOUrfatKeg079OZRtx2LDLnxoGg68Y/1lay6NfnKY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/evF-iu-CIi-view-Bi4-0u-Txz.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			i+jmL9VEsZ/X6yx5f0fjB3W5kae0WepopK5xVGBjOgA=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/evF-iu-CIi-view-Bi4-0u-Txz.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			Cv6suEdriBUwYojtW1//dfkdWUALaPLEP6l1Vyfl+ZY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/knH-wI-eUH-view-xtk-8f-w2e.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			H3jlwOKDUTOX00drzSNuenDP7I2XDgTz2zBNY6Z/YSQ=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/knH-wI-eUH-view-xtk-8f-w2e.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			LHZU8OP/q1dG4YSW8iggZKnnvGP9icrtrMAXZt6xNEI=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/mKi-5s-kli-view-kGR-a0-dCN.nib/objects-12.3+.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			rMRwLIjSK2SXp6XiDKDX0vySVnKIQidVILN/ksGrZBY=
			</data>
		</dict>
		<key>DefaultUI.storyboardc/mKi-5s-kli-view-kGR-a0-dCN.nib/runtime.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			7Sby4JMaMuTfDu0qeQngOZW3boX9F3oViGm73BKqG3s=
			</data>
		</dict>
		<key>IDCardScannerHandle.png</key>
		<dict>
			<key>hash2</key>
			<data>
			/BabfZS//4ZAmucncwBOW50wx/ffQkzI18UBczGqGvg=
			</data>
		</dict>
		<key>IDCardScannerHandle@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			6ALISu7fo1PCMO4Yu1nvgjlxPowJblgknMJYyUSEOIc=
			</data>
		</dict>
		<key>IDCardScannerHandle@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			HfBDkHeNBJgu8X5cL4UkDYdkh0J8g+VZCN1YfnnTkyw=
			</data>
		</dict>
		<key>ImageEditing.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			xPvFJO5UFdhMDtLnmVtm3lQKm4YQj81+u1ouivOeq3w=
			</data>
		</dict>
		<key>ImageEditing.storyboardc/Vwq-hB-na2-view-RhM-Dv-nUe.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			KQVZB0WEPPPVf0VyNYP97f5uXvHweijRfu45cHUAHHo=
			</data>
		</dict>
		<key>ImageEditing.storyboardc/imageEditing.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			BcFjg8D2kqrC5EHmTFQggV1FR5R+ASZxuQsldCKxvc0=
			</data>
		</dict>
		<key>Licenses.txt</key>
		<dict>
			<key>hash2</key>
			<data>
			o13UBLvgbdSn8mFO8tEPlnNuZqYEdXBXPyDAXWLJ34k=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/BackgroundCleanFilterModel.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			NAE68zltpZJMpek+DyRjE89lARSrOV+iUsptmZKYksg=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/Bleep.m4a</key>
		<dict>
			<key>hash2</key>
			<data>
			6m1V+uTPfaeN753jmW58KJH+Bq6BeDdJ0ZlkWeOCgts=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/BlurEstimatorModel.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			VV432vQP1fY913SRwbdKGKXHOM0sxkVanMTIxEfc+68=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/CountryCodeToLanguageCode.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			zrWQVsBvmxAmpjQPfZvw0KEPeWW6ykjD5vc6+BOz1es=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			5DwpQzb0Cf1LCXdeG8GxBOpcUTs2PWbhmTG3fA3JA0U=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/LanguageToTesseractTrainedData.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			3DC6A/RFSlrHux2e4VcX38M+/Au9jpjqk4zV1wKmHF4=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/Licenses.txt</key>
		<dict>
			<key>hash2</key>
			<data>
			o13UBLvgbdSn8mFO8tEPlnNuZqYEdXBXPyDAXWLJ34k=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/MLBinarization.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			wSiAJGwumx07hwrw8vFfeWULJemhNkr+uR3N1AJwYKk=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKChequeData/ChequeDigitRecognizerModel.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			LAsNcyQzpFaBR69oTxH6kwo36nsBTnDlQ2xv7zVu4PU=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKDCData/DCDigitRecognizerModel.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			kprCojuXvjwKvwCK9oyIQDo15kHYltugu8qLqOxZMOk=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKDCData/DCLabelImagePreprocessor.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			+aKn6BSjz3k4mFV3gEYFcoDFPFXyn0uU/b8CUHnGU+k=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKIDCardData/char-ocrb-20200520-3.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			shA/lnF0vFz30NnMZA2jTfT3O5uJmBN6KTXYShxzIRM=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKIDCardData/id-card-binarization-20200519-2.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			QkbtLw7KgYAr4xfxXtqH4KDzhKKFpD1nJgByUA3gl6o=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKIDCardData/id-card-localization-20200703-2.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			anzxkgEneEHjUnxM8+oB6Z+wYSRn4iHCBiLGtnJCRE0=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKPDFData/pdf.dat</key>
		<dict>
			<key>hash2</key>
			<data>
			wUcRkDgRRT/SInWQAXDFgUAgKWXewuUORFccLe24BOg=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKPDFData/pdf.ttx</key>
		<dict>
			<key>hash2</key>
			<data>
			FVZn9ruUkAXCxAq4n8NxdHcmXfmThgDIyVz5WY8ohMk=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/SBSDKPayformData/banks.csv</key>
		<dict>
			<key>hash2</key>
			<data>
			jTXtUk1AXRnvltXRypz4EO+KwUSOEgYcv3PyYb/JBpA=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/barcode-binarization-model-20200624-1.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			aZUzgpOPfGRqgMHAUPFHGsydfMlQdiugVkbIv4zaS8Y=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/barcode-detector-20200625-1.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			mG4y6qMexlNYwDnHynKdmeDPTq++1EgsbSiQNd6u5pI=
			</data>
		</dict>
		<key>ScanbotSDK.bundle/id-card-binarization-20200519-2.tflite</key>
		<dict>
			<key>hash2</key>
			<data>
			QkbtLw7KgYAr4xfxXtqH4KDzhKKFpD1nJgByUA3gl6o=
			</data>
		</dict>
		<key>default.metallib</key>
		<dict>
			<key>hash2</key>
			<data>
			NvGjzEEoYTjC1w1iq1hh3H4DWHpCAb4yGezJsi2XcGM=
			</data>
		</dict>
		<key>ico_capture_reviewarrow.png</key>
		<dict>
			<key>hash2</key>
			<data>
			4Cwjm+012Y5gRUQj68QHI5lS9dPOAlUNaADlGew/8ms=
			</data>
		</dict>
		<key>ico_capture_reviewarrow@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			mLBFHmQW898pGHyYFDqQfwQXZfNMg376jzvGZk8bmUE=
			</data>
		</dict>
		<key>ico_capture_reviewarrow@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			R1Qq+h/yxWBefbJtfWxJY5SOJtuqxo3TWez0Jd22jGc=
			</data>
		</dict>
		<key>icon_check.png</key>
		<dict>
			<key>hash2</key>
			<data>
			S9Lp1QxE9Mjf8ymu0HAYeXfyR8IqI+eVVW7aArtJnnE=
			</data>
		</dict>
		<key>icon_check@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			3KQqAvJDvtN0w5QczR4RakZrX6TztK8lf2o9VXnL5PM=
			</data>
		</dict>
		<key>icon_check@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			85wTpw6orKUxrlEvn/RVD0SA8ttmWQ314U2AQnWZhHU=
			</data>
		</dict>
		<key>icon_x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			KsXKy+9sHo6qD+HkzI8tBEErXk2alZsUw8TNsI/tqaY=
			</data>
		</dict>
		<key>icon_x@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			566NVik+fqhPP8xsaPzPVmdsFi1ZKo12Kf9d+dIORGc=
			</data>
		</dict>
		<key>icon_x@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			XEA8qc/N4HWdcWuDYHsydC4MkBc6aP56wCrHhIcaCWk=
			</data>
		</dict>
		<key>no-nfc.png</key>
		<dict>
			<key>hash2</key>
			<data>
			qUelGPY97etcKOdt9qzQRfx9+Z0FW0y8ZMilhqUaWSM=
			</data>
		</dict>
		<key>no-nfc@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			cNRLfd4eqPpZdswSDFX92FmERzhLvC5OcuKNltqqP6o=
			</data>
		</dict>
		<key>no-nfc@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			Y2Xz6l02YYE7LlRfu+C2i/cGAEsWCA8pD046vG+veEg=
			</data>
		</dict>
		<key>strip-SBSDK-Framework.sh</key>
		<dict>
			<key>hash2</key>
			<data>
			zzXN0Z/tfOelMjfoHbK8p9N16PdV0+m5BKxE8S2MqrM=
			</data>
		</dict>
		<key>ui_capture_edit_magnifier.png</key>
		<dict>
			<key>hash2</key>
			<data>
			qPfufLXaKN0YgYGaz6lg2XKX8hi3CmEs1M+OMrwn/CQ=
			</data>
		</dict>
		<key>ui_capture_edit_magnifier@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			HziGfEMVqwvXT7v4LgjzzCg/bmIr/Vlb3+1O5prpi2M=
			</data>
		</dict>
		<key>ui_capture_edit_magnifier@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			bpTK/Yt8Rd80M5jCKK3sd25eUPU34ACfb3FUC+bX8j8=
			</data>
		</dict>
		<key>ui_scan_handlebig.png</key>
		<dict>
			<key>hash2</key>
			<data>
			yXQMTeYyTBzTTMWXIrc4VtuddpglQZKnpIAdeUlOHEk=
			</data>
		</dict>
		<key>ui_scan_handlebig@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			K32+F2wpJL/oCpW5/KBYYEbsp6XqyCayp3XK09o6HMY=
			</data>
		</dict>
		<key>ui_scan_handlebig@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			XphnzOXinV0TPjRfkPhZY736k0R9qjyiGfsVQKtS9TU=
			</data>
		</dict>
		<key>ui_scan_handlesmall.png</key>
		<dict>
			<key>hash2</key>
			<data>
			VXzv0V4NRozaoHcYcvREdMAZs3sUh9pkqOpK+Tivfrc=
			</data>
		</dict>
		<key>ui_scan_handlesmall@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			um1UM4PlY4gmrCp1X3RPeo1RR+MNHoLcV2QQ2sLL95I=
			</data>
		</dict>
		<key>ui_scan_handlesmall@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			QiagnhVatW26NXnlUYz3WJlO/M5U7JmjQBNTJdrGfmY=
			</data>
		</dict>
		<key>ui_scan_snapbutton_active.png</key>
		<dict>
			<key>hash2</key>
			<data>
			eVMgxxQQdIJGwJJ3XsEaot8VMd+cOmzlRTWsM/ImxzQ=
			</data>
		</dict>
		<key>ui_scan_snapbutton_active@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			H3O63vdfEKB9PaurfLAA1ieDFrScZ48I4FRA6fG8ccs=
			</data>
		</dict>
		<key>ui_scan_snapbutton_active@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			dnt6WllaPz3xTz+QmIit6k727P9A/ipQQFeeRMJcCQ0=
			</data>
		</dict>
		<key>ui_scan_snapbutton_innerarc.png</key>
		<dict>
			<key>hash2</key>
			<data>
			3W593KK8ZTyxU/ZDkZphdezI110BdLUnhXq/CY18apo=
			</data>
		</dict>
		<key>ui_scan_snapbutton_innerarc@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			JvJsoIYa0pAiP/NhoOU8T5QBoay/ZuqtvZ35Bl+6UIU=
			</data>
		</dict>
		<key>ui_scan_snapbutton_innerarc@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			e0/Hnjck/oT8Iv1ta+RmaMMMlwPpeP7Hvcv+XI6uqzI=
			</data>
		</dict>
		<key>ui_scan_snapbutton_outerarc.png</key>
		<dict>
			<key>hash2</key>
			<data>
			g1R81/cgb0nDYRmH9agaHXOnFYEKYJvBQoEZAX471nw=
			</data>
		</dict>
		<key>ui_scan_snapbutton_outerarc@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			E1XedSlWyojcTKNqwHrCJMGF/d3q8kHrTxp8Op/KOmU=
			</data>
		</dict>
		<key>ui_scan_snapbutton_outerarc@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			ik40hc9B7AtQ+6ywAqqu2Hr1SOTMWiqvIAUCNGca+bQ=
			</data>
		</dict>
		<key>ui_scan_snapbutton_outerring.png</key>
		<dict>
			<key>hash2</key>
			<data>
			KbqSA7H7NOj6K2dQVc/NHDw6Yx1sC+f4RIZL/5GFMR4=
			</data>
		</dict>
		<key>ui_scan_snapbutton_outerring@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			5WbBxSzlBX7UgzgDH6vPIsdzxF4te3AzjoMOGDMOd94=
			</data>
		</dict>
		<key>ui_scan_snapbutton_outerring@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			oJ1Q36xv4hmt9Es6xKs/W070EHbuCrdq/surTLbRBZA=
			</data>
		</dict>
		<key>ui_scanning_automatic.png</key>
		<dict>
			<key>hash2</key>
			<data>
			c8jVTMXgxHbd2+4tH/lJjescJFlsM6Rms+HbIrUP9fk=
			</data>
		</dict>
		<key>ui_scanning_automatic@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			mG02GyEPo8b18yRsiuR5eNxjDolpOoTT7TkDXFX0Njs=
			</data>
		</dict>
		<key>ui_scanning_automatic@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			o4yl1p09aRZuLo9Eh+tVTwTCnxZ2g4MuZT5gS/zYCpk=
			</data>
		</dict>
		<key>ui_scanning_delete.png</key>
		<dict>
			<key>hash2</key>
			<data>
			TA6f1rc4l2jMdh9aXEM9dWaCEMflsIt+5/OQpagYcWI=
			</data>
		</dict>
		<key>ui_scanning_delete@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			NbYPsCkd8JE5GRpwQv+oQHnw5CqmPDhlSQ9kb2YMXqk=
			</data>
		</dict>
		<key>ui_scanning_delete@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			2Fhg64W3N9k+wKEZz1JBBAIvkaLiNlXVNv6ZgRyBTnw=
			</data>
		</dict>
		<key>ui_scanning_flash.png</key>
		<dict>
			<key>hash2</key>
			<data>
			OtaraxejSCjK6cJi7pRoN5l1AAN38JzyUeWhypKhwNU=
			</data>
		</dict>
		<key>ui_scanning_flash@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			43VeABIL1kLKkuGtXp2YSg+mVbmH4/SsG2SzCR4WcHo=
			</data>
		</dict>
		<key>ui_scanning_flash@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			fOGauUfJW6MzBnCqmK8y5fFgQ/b+AvpyHuG/QBr/3zQ=
			</data>
		</dict>
		<key>ui_scanning_flash_off.png</key>
		<dict>
			<key>hash2</key>
			<data>
			i6UsVxZe8JkiT/Mlq4IZBGjzv6oV12HAjgRZDPC5VDM=
			</data>
		</dict>
		<key>ui_scanning_flash_off@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			a4pdUEhlAza4M4Zeih6LG+eggf1xicAdD3fJc2Mq1jk=
			</data>
		</dict>
		<key>ui_scanning_flash_off@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			ZY1n6oZvu1hliStrXTZ0FrMN3UT2ybKksw3qCRn+H14=
			</data>
		</dict>
		<key>ui_scanning_flash_on.png</key>
		<dict>
			<key>hash2</key>
			<data>
			wHGlStF7ckMCiIvcrHlP9oMXSvNXMPFJAQM7qvClwXI=
			</data>
		</dict>
		<key>ui_scanning_flash_on@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			CGpMmz1tlthrBALF+bS3jhVY5+81brwGpEIcVFzYTk4=
			</data>
		</dict>
		<key>ui_scanning_flash_on@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			LhIb3KLvpvMEfsGtfu/GG9nRNR0Dwup31BA0lq2HOAQ=
			</data>
		</dict>
		<key>ui_scanning_multipage.png</key>
		<dict>
			<key>hash2</key>
			<data>
			gppKi+LWHeJ9xlecCZ1ctmwSn6EotzgquwPW2KuYfuk=
			</data>
		</dict>
		<key>ui_scanning_multipage@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			n+4rP2e7SN1Y6pJnLZspEMAdkMjPQ+Bh6FHwgSzYcgo=
			</data>
		</dict>
		<key>ui_scanning_multipage@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			Xa50i2lHtpVbJb9J8/CZFVJHmWDrc2hKiqbBkQ4Gg9U=
			</data>
		</dict>
		<key>ui_scanning_permission.png</key>
		<dict>
			<key>hash2</key>
			<data>
			h+NQ9jbseQFCpSopjOBfcTmBjqFVDikv4zKfYJNMWDU=
			</data>
		</dict>
		<key>ui_scanning_permission@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			WUqRwVQTN0DGAxBNes7KveQ37mAhfz0AVs7NXUrrMA0=
			</data>
		</dict>
		<key>ui_scanning_permission@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			zijmLF+GDSJ3qDPIpIL+foeOkNmVB3ljn/irJNmDvSE=
			</data>
		</dict>
		<key>ui_sdk_split_view.png</key>
		<dict>
			<key>hash2</key>
			<data>
			fJkXziV9N2KjGFyQhrZZ6fhusgqec2ZlbvvH0PX1fNE=
			</data>
		</dict>
		<key>ui_sdk_split_view@2x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			Rf+BklFGo3r0m93mIdTQmquf5BX/Xl+VJo1iXSRcpEs=
			</data>
		</dict>
		<key>ui_sdk_split_view@3x.png</key>
		<dict>
			<key>hash2</key>
			<data>
			Hu0Sr0qOnJM5YaolM4DAblkOXJ7+A1gorhzKufEKVKs=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
